app/controllers/votes_controller.rb

  def create
    @topic= Topic.find(params[:topic_id])
    @vote= @topic.votes.create!
---
SELECT * FROM "topics" WHERE ("topics"."id" = 2)
INSERT INTO "votes" ("topic_id", "updated_at", "created_at") VALUES(2, '2009-06-13 22:41:41', '2009-06-13 22:41:41')